jmeter/jmeter.log
2023-04-20 09:30:08,074 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-04-20 09:30:08,088 INFO o.a.j.JMeter: Loading user properties from: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\apache-jmeter-5.5\bin\user.properties
2023-04-20 09:30:08,089 INFO o.a.j.JMeter: Loading system properties from: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\apache-jmeter-5.5\bin\system.properties
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: Version 5.5
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: java.version=1.8.0_361
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) Client VM
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: os.name=Windows 10
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: os.arch=x86
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: os.version=10.0
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: file.encoding=Cp1252
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: java.awt.headless=true
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: Max memory     =1073741824
2023-04-20 09:30:08,090 INFO o.a.j.JMeter: Available Processors =8
2023-04-20 09:30:08,103 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-04-20 09:30:08,103 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-04-20 09:30:08,103 INFO o.a.j.JMeter: JMeterHome=C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\apache-jmeter-5.5
2023-04-20 09:30:08,103 INFO o.a.j.JMeter: user.dir  =C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter
2023-04-20 09:30:08,103 INFO o.a.j.JMeter: PWD       =C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter
2023-04-20 09:30:12,627 INFO o.a.j.JMeter: IP: 172.28.208.1 Name: cs190802w FullName: cs190802w.codespring.ro
2023-04-20 09:30:12,812 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report'
2023-04-20 09:30:12,812 INFO o.a.j.s.FileServer: Default base='C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter'
2023-04-20 09:30:12,812 INFO o.a.j.s.FileServer: Set new base='C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\.'
2023-04-20 09:30:12,928 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-04-20 09:30:12,957 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-04-20 09:30:12,962 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-04-20 09:30:12,969 INFO o.a.j.s.SaveService: Loading file: .\RestApi.jmx
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-04-20 09:30:13,060 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-04-20 09:30:13,345 INFO o.a.j.JMeter: Creating summariser <summary>
2023-04-20 09:30:13,361 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2023-04-20 09:30:13,361 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: log.csv
2023-04-20 09:30:13,361 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\apache-jmeter-5.5\bin\reportgenerator.properties
2023-04-20 09:30:13,361 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2023-04-20 09:30:13,361 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,379 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,380 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,380 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,380 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,380 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-04-20 09:30:13,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2023-04-20 09:30:13,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2023-04-20 09:30:13,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2023-04-20 09:30:13,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2023-04-20 09:30:13,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2023-04-20 09:30:13,383 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2023-04-20 09:30:13,389 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-04-20 09:30:13,390 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-04-20 09:30:13,390 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-04-20 09:30:13,397 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-04-20 09:30:13,397 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-04-20 09:30:13,682 INFO o.a.j.JMeter: Running test (1681972213682)
2023-04-20 09:30:13,731 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : RestApi
2023-04-20 09:30:13,731 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group RestApi.
2023-04-20 09:30:13,731 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-04-20 09:30:13,731 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 delayedStart=true
2023-04-20 09:30:13,731 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-04-20 09:30:13,731 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-04-20 09:30:13,763 INFO o.a.j.t.JMeterThread: Thread started: RestApi 1-1
2023-04-20 09:30:13,763 INFO o.a.j.s.FileServer: Stored: C:/Users/Ballai.Tamas/Documents/Mesteri/Diss/WeatherApp/house-prices.csv
2023-04-20 09:30:13,763 INFO o.a.j.s.FileServer: Stored: C:/Users/Ballai.Tamas/Documents/Mesteri/Diss/WeatherApp/people-100000.csv
2023-04-20 09:30:13,794 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = cs190802w
2023-04-20 09:30:13,794 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2023-04-20 09:30:13,794 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-04-20 09:30:13,794 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-04-20 09:30:13,794 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-04-20 09:30:13,794 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-04-20 09:30:14,117 INFO o.a.j.t.JMeterThread: Thread is done: RestApi 1-1
2023-04-20 09:30:14,117 INFO o.a.j.t.JMeterThread: Thread finished: RestApi 1-1
2023-04-20 09:30:14,119 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-04-20 09:30:14,119 INFO o.a.j.s.FileServer: Close: C:/Users/Ballai.Tamas/Documents/Mesteri/Diss/WeatherApp/people-100000.csv
2023-04-20 09:30:14,122 INFO o.a.j.s.FileServer: Close: C:/Users/Ballai.Tamas/Documents/Mesteri/Diss/WeatherApp/house-prices.csv
2023-04-20 09:30:14,125 INFO o.a.j.r.Summariser: summary =      1 in 00:00:00 =    2.3/s Avg:   230 Min:   230 Max:   230 Err:     0 (0.00%)
2023-04-20 09:30:14,126 INFO o.a.j.JMeter: Generating Dashboard
2023-04-20 09:30:14,127 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2023-04-20 09:30:14,157 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2023-04-20 09:30:15,032 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2023-04-20 09:30:15,049 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2023-04-20 09:30:15,049 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2023-04-20 09:30:15,049 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2023-04-20 09:30:15,049 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2023-04-20 09:30:15,053 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2023-04-20 09:30:15,053 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 7 samples
2023-04-20 09:30:15,053 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2023-04-20 09:30:15,053 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2023-04-20 09:30:15,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2023-04-20 09:30:15,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2023-04-20 09:30:15,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2023-04-20 09:30:15,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2023-04-20 09:30:15,054 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 15 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 3 samples
2023-04-20 09:30:15,055 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 1 samples
2023-04-20 09:30:15,056 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 1 samples produced in 846ms on channel 0
2023-04-20 09:30:15,056 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2023-04-20 09:30:15,179 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2023-04-20 09:30:15,179 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2023-04-20 09:30:15,179 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2023-04-20 09:30:15,195 INFO o.a.j.r.d.JsonExporter: Checking output folder
2023-04-20 09:30:15,195 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report\statistics.json
2023-04-20 09:30:15,233 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2023-04-20 09:30:15,233 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report
2023-04-20 09:30:15,349 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report, creating folder structure
2023-04-20 09:30:15,349 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\apache-jmeter-5.5\bin\report-template' to 'C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report', got message: C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report, found non empty folder with following content [C:\Users\Ballai.Tamas\Documents\Mesteri\Diss\WeatherApp\JMeter\report\statistics.json], will be ignored
2023-04-20 09:30:15,865 INFO o.a.j.JMeter: Dashboard generated