jmeter/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 230.0,
    "medianResTime" : 230.0,
    "minResTime" : 230.0,
    "maxResTime" : 230.0,
    "pct1ResTime" : 230.0,
    "pct2ResTime" : 230.0,
    "pct3ResTime" : 230.0,
    "throughput" : 4.3478260869565215,
    "receivedKBytesPerSec" : 1.6771399456521738,
    "sentKBytesPerSec" : 1.953125
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 230.0,
    "medianResTime" : 230.0,
    "minResTime" : 230.0,
    "maxResTime" : 230.0,
    "pct1ResTime" : 230.0,
    "pct2ResTime" : 230.0,
    "pct3ResTime" : 230.0,
    "throughput" : 4.3478260869565215,
    "receivedKBytesPerSec" : 1.6771399456521738,
    "sentKBytesPerSec" : 1.953125
  }
}